square/square/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 0)
    (10 0 0)
    (10 1 0)
    (0 1 0)
    (0 0 1)
    (10 0 1)
    (10 1 1)
    (0 1 1)
);



blocks
(
    hex (0 1 2 3 4 5 6 7)
    (100 10 10)
    simpleGrading (1 3 3)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    Wall
    {
        type wall;
        faces
        (
            (0 1 2 3)
            (0 1 5 4)
            (4 5 6 7)
            (3 2 6 7)
        );
    }
   
);
mergePatchPairs
(
);

// ************************************************************************* //
